package com.kaesar.sword2offer;

/**
 * 备忘录
 */
public class Jz00 {

  // 第二遍刷题后需要复习的题目
  /**
   * Jz04 重建二叉树    ☆☆☆☆☆
   * Jz15 反转链表    ☆☆☆☆☆
   * Jz17 树的子结构    ☆☆☆☆☆
   * Jz19 顺时针打印矩阵    ☆☆☆☆☆
   * Jz24 二叉树中和为某一值的路径    ☆☆☆☆☆
   * Jz26 二叉搜索树与双向链表    ☆☆☆☆☆
   * Jz27 字符串的排列    ☆☆☆☆☆
   * Jz29 最小的 K 个数。PriorityQueue的用法。大顶堆 小顶堆的概念    ☆☆☆☆☆
   * Jz33 丑数。动态规划    ☆☆☆☆☆
   * Jz39 平衡二叉树。递归    ☆☆☆☆☆
   * Jz40 数组中只出现一次的数字。位运算    ☆☆☆☆☆
   * Jz43 左旋转字符串。字符串操作    ☆☆☆☆☆
   * Jz48 不用加减乘除做加法。位运算    ☆☆☆☆☆
   * Jz52 正则表达式匹配。正则表达式    ☆☆☆☆☆
   * Jz53 表示数值的字符串。正则表达式    ☆☆☆☆☆
   * Jz54 字符流中第一个不重复的字符    ☆☆☆☆☆
   */

  // 第一遍刷题后需要复习的题目
  /**
   * Jz04 二叉树
   * Jz17 判断树的子结构
   * Jz21 判断栈的压入、弹出序列 复习
   * Jz22 从上往下打印二叉树
   * Jz23 二叉搜索树的后序遍历序列。重点复习
   * Jz24 二叉树中和为某一值的路径。重点复习
   * Jz25 复杂链表的复制
   * Jz26 二叉搜索树与双向链表
   * Jz27 字符串的排列
   * Jz28 数组中出现次数超过一半的数字
   * Jz33 丑数
   * Jz35 数组中的逆序对
   * Jz38 二叉树的深度 递归
   * Jz39 平衡二叉树  递归
   * Jz40 位运算
   * Jz44 翻转单词顺序列 字符串操作
   * Jz45 扑克牌顺子
   * Jz46 圆圈中最后剩下的数
   * Jz47 求 1+2+3+...+n
   * Jz48 不用加减乘除做加法
   * Jz49 把字符串转换成整数
   * Jz51 构建乘积数组
   * Jz52 正则表达式匹配问题，复习。需要详细学习正则表达式的常用用法
   * Jz54 字符流中第一个不重复的字符
   * Jz58 对称的二叉树
   * Jz61 序列化二叉树
   * Jz62 二叉查找树的第 K 个结点。  -- 中序遍历
   * Jz63 数据流中的中位数
   * Jz64 滑动窗口的最大值
   * Jz67 的动态规划方法需要复习
   * Jz68 需要复习
   * Jz70 数字序列中的某一位数字
   * Jz71 / Jz72 把数字翻译成字符串  动态规划
   * Jz73 最长不含重复字符的子字符串
   * Jz74 n 个骰子的点数
   * Jz75 股票的最大利润
   * Jz76 树中两个节点的最低公共祖先
   */
}